/* 
  Localizable.strings
  CSResourceFork

  Created by Charles Srstka on 2/19/12.
  Copyright (c) 2012 __MyCompanyName__. All rights reserved.
*/

"Yes" = "Yes";
"No" = "No";

"Error" = "Error";
"Warning" = "Warning";

"NOT_RSRC_FILE" = "The file “%@” is not a resource file.";
"UNKNOWN_ERROR" = "Unknown error";

"FORK_READ_ERROR" = "Error reading data from the resource fork: %d";
"FORK_WRITE_ERROR" = "Error writing data to the resource fork: %d";

"NOT_A_READ_HANDLE" = "This file handle is not able to read data.";
"NOT_A_WRITE_HANDLE" = "This file handle is not able to write data.";

"RES_TOO_LARGE" = "The size of ‘%@’ ID %d is %lu bytes, but a resource cannot have a size larger than %lu bytes.";
"RES_DATA_TOO_LARGE" = "The combined size of the resources in this resource file exceeds %lu bytes, which is not allowed.";

"TOO_MANY_TYPES" = "A resource file cannot contain more than %lu resource types.";

"TYPE_LIST_OFFSET_TOO_LARGE" = "The resource type list offset is %lu, but the maximum is %lu.";
"NAME_LIST_OFFSET_TOO_LARGE" = "The resource name list offset is %lu, but the maximum is %lu.";
"RES_NAME_OFFSET_TOO_LARGE" = "The offset for the name for resource ‘%@’ ID %d is too large; the maximum is %lu.";
"RES_DATA_OFFSET_TOO_LARGE" = "The offset for the resource data for ‘%@’ ID %d is too large; the maximum is %lu.";
"REF_LIST_TOO_LONG" = "The reference list for type ‘%@’ is too long; it must be shorter than %lu bytes.";
"TOO_MANY_RESOURCES" = "Too many resources of type ‘%@’; the maximum is %lu.";

"INVALID_RESOURCE_TYPE" = "Invalid resource type ‘%@’.";
"INVALID_RESOURCE_ID" = "Invalid resource id %ld; only values from %d to %d are allowed.";

"RES_DATA_NOT_FOUND" = "Couldn't find the resource data for ‘%@’ ID %d.";

"RES_ALREADY_EXISTS" = "A resource already exists with type ‘%@’ and ID %d.";
"RES_NOT_FOUND" = "Resource type ‘%@’ %d not found.";

"FORK_ALREADY_EXISTS" = "The specified fork already exists.";
"FORK_NOT_FOUND" = "The specified fork does not exist.";

"XATTR_NOT_FOUND" = "The extended attribute “%@” does not appear to exist.";
"XATTR_ALREADY_EXISTS" = "An extended attribute with name “%@” already exists.";

"INVALID_HFS_TYPE" = "Invalid type “%@”.";
"INVALID_CREATOR" = "Invalid creator “%@”.";

"DATA_FORK_NOT_SUPPORTED" = "The file “%@” doesn’t support the data fork.";
"RSRC_FORK_NOT_SUPPORTED" = "The file “%@” doesn’t support the resource fork.";
"XATTRS_NOT_SUPPORTED" = "The file “%@” doesn’t support extended attributes.";
"SPECIAL_XATTR_NOT_SUPPORTED" = "Sorry, the special extended attribute “%@” is not supported.";
"SPECIAL_XATTR_CANNOT_BE_RENAMED" = "Sorry, the special extended attribute “%@” cannot be renamed.";

"UID_NOT_FOUND" = "No user exists with ID %lu.";
"USER_NAME_NOT_FOUND" = "No user exists with name “%@”.";

"GID_NOT_FOUND" = "No group exists with ID %lu.";
"GROUP_NAME_NOT_FOUND" = "No group exists with name “%@”.";

// ACL stuff

"User" = "user";
"Group" = "group";
"Unknown" = "unknown";

"allow" = "allow";
"deny" = "deny";

"ACL_READ_DATA" = "read";
"ACL_LIST_DIRECTORY" = "list";
"ACL_WRITE_DATA" = "write";
"ACL_ADD_FILE" = "add_file";
"ACL_EXECUTE" = "execute";
"ACL_SEARCH" = "search";
"ACL_DELETE" = "delete";
"ACL_APPEND_DATA" = "append";
"ACL_ADD_SUBDIRECTORY" = "add_subdirectory";
"ACL_DELETE_CHILD" = "delete_child";
"ACL_READ_ATTRIBUTES" = "readattr";
"ACL_WRITE_ATTRIBUTES" = "writeattr";
"ACL_READ_EXTATTRIBUTES" = "readextattr";
"ACL_WRITE_EXTATTRIBUTES" = "writeextattr";
"ACL_READ_SECURITY" = "readsecurity";
"ACL_WRITE_SECURITY" = "writesecurity";
"ACL_CHANGE_OWNER" = "chown";

"ACL_FILE_INHERIT" = "file_inherit";
"ACL_DIRECTORY_INHERIT" = "directory_inherit";
"ACL_LIMIT_INHERIT" = "limit_inherit";
"ACL_ONLY_INHERIT" = "only_inherit";

"ACL_PERM_SEPARATOR" = ", ";
